blogger/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		# @ makes it an instance variable. It is accessible
		# from both the controller and the view. Normally, it's
		# only available to methods within an instance. Rails
		# controllers transfer instance variables to the object
		# that renders the view template.
		# This view template must be created in app/views/articles
		@articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tags Article"], ["body", "This article is meant to test the tag feature"], ["created_at", "2020-07-19 21:35:22.840636"], ["updated_at", "2020-07-19 21:35:22.840636"]]
---
	def create
		# @article = Article.new(params[:article]) (passes whole hash, but not safe)
		# @article.title = params[:article][:title] (Unnecessary)
		# @article.body = params[:article][:body] (Unnecessary)
		@article = Article.new(article_params) # uses helper method and require/permit
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "download.jpg"], ["image_file_size", 3650], ["image_updated_at", "2020-07-20 20:53:21.891978"], ["updated_at", "2020-07-20 20:53:21.953725"], ["id", 1]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params) # calls helper method